Repository: 84000/data-translation-memory
Catalog: Toh_157-The_Questions_of_the_Kimnara_King_Druma-v2.tmx
Source language: bo
Languages: en

source: ཀཽ་ཤི་ཀ་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་ཁྱོད་འབའ་ཞིག་ཟིལ་གྱིས་མནན་པ་མ་ཡིན་གྱིས།
en: “Kauśika,” “it is not only you that the kiṃnara king Druma surpasses.

source: ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ས་ཐོབ་པ་མ་གཏོགས་པར་གང་དག་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་དེ་དག་ཐམས་ཅད་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་ཟིལ་གྱིས་ནོན་ཏོ། །
en: Kauśika, with the exception of bodhisattva great beings who have reached the bodhisattva levels, the kiṃnara king Druma surpasses Śakra, Brahmā, and the protectors of the world, as well as all the hearers and solitary buddhas of this great trichiliocosm.

source: ཀཽ་ཤི་ཀ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་བསྐྱེད་མ་ཐག་པས། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་དང་། བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་ཐམས་ཅད་ཟིལ་གྱིས་ནོན་ཏོ། །
en: Because, Kauśika, as soon as bodhisattvas give rise to the mind set on awakening, they surpass all hearers and solitary buddhas, as well as Śakra, Brahmā, and all the protectors of the world.

source: ཀཽ་ཤི་ཀ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ནི་ལྷར་བཅས་པའི་འཇིག་རྟེན་གྱིས་ཟིལ་གྱིས་མི་ནོན་ཏོ། །
en: Kauśika, this being so, bodhisattvas cannot be surpassed by the world with its gods.

source: གང་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཟིལ་གྱིས་གནོན་པར་སེམས་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་ཟིལ་གྱིས་གནོན་པར་འདོད་པའོ། །
en: Wishing to surpass the bodhisattvas is the same as wishing to surpass the thus-gone ones.

source: བྱང་ཆུབ་སེམས་དཔའ་ལས་ནི་དེ་བཞིན་གཤེགས་པ་འབྱུང་ངོ་། །
en: It is because the thus-gone ones originate from the bodhisattvas, and

source: དེ་བཞིན་གཤེགས་པ་ལས་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་འབྱུང་ངོ་། །
en: the hearers and the solitary buddhas originate from the thus-gone ones.”

source: དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བསྟན་པ་འདི་ཐོས་ནས་ཐལ་མོ་སྦྱར་ཏེ་མཆི་མ་བླགས་ནས་འདི་སྐད་ཅེས་ཀྱེ་མའོ། །
en: When he heard this teaching, Śakra, lord of the gods, joined his palms together, shed tears, and exclaimed, “Alas!

source: བདག་ནི་སངས་རྒྱས་ཀྱི་མཁྱེན་པ་ཆགས་པ་མི་མངའ་ཞིང་སྒྲིབ་པ་མི་མངའ་བ་འདི་ལྟ་བུ་ལས་ཉམས་སོ་ཞེས་སྨྲས་སོ། །
en: My wisdom is weaker than the dispassionate and unobstructed wisdom of the buddhas!”

source: དེ་ནས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱི་བུ་ལྷའི་བུ་འོད་ཟེར་སྲུང་ཞེས་བྱ་བ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་པ་དེས་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: At that moment, the son of Śakra, lord of the gods, the god Kāśyapa, who was present in the assembly, said to his father,

source: ཡང་འདི་ལྟར་གང་རབ་ཏུ་དབེན་པ་རྣམ་པར་བསྒྲུབ་པར་ཉེ་བར་གནས་པའི་མཚན་ཉིད་མ་ལགས་པའི་ཆོས་རྣམས་ལ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་མི་བསྐྱེད་པ་དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་རྙེད་པ་མ་ལགས།
en: “Father, given that phenomena are completely isolated and do not have the characteristic of being involved in creation, those who do not give rise to the mind set on unsurpassed and supreme awakening are not being compassionate toward all sentient beings.

source: རྒྱ་ཆེན་པོ་ལ་མོས་པའི་དགེ་བའི་བཤེས་གཉེན་ལ་སྟེན་པ་མ་ལགས་ཏེ། ཕྱིས་འགྱོད་པར་འགྱུར་བའོ། །
en: They do not attend to virtuous friends dedicated to the vast approach and they will feel regret in the future.

source: ཡབ་སྐྱོན་མེད་པ་ལ་ཞུགས་ཏེ་རྒྱུད་ཚིག་ཅིང་ས་བོན་ཚིག་སྟེ།
en: Father, they are submerged in the faultless, their mental continuum is burned, and their seed is burned.

source: ཐེག་པ་ཆེན་པོའི་སྣོད་དུ་མ་གྱུར་པ་ལ་ད་བགྱིར་ཅི་མཆིས།
en: They are not proper vessels for the Great Vehicle. What can be done?”

source: བསྟན་པ་འདི་བཤད་པ་ན་སུམ་ཅུ་རྩ་གསུམ་རིས་ཀྱི་ལྷའི་བུ་ལས་ལྷའི་བུ་སྟོང་ཐམ་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: When this teaching was given, one thousand gods among the gods of the Heaven of the Thirty-Three gave rise to the mind set on unsurpassed and supreme awakening.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ལྷའི་བུ་འོད་ཟེར་སྲུང་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then, the divine son Guardian of Light Rays said,

source: བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དཀའ་བ་སྤྱད་པ་བརྒྱ་སྟོང་ཕྲག་ཇི་སྙེད་པ་བཅོམ་ལྡན་འདས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བསྟར་བ་ནི་བདག་ལ་མངོན་སུམ་དུ་གྱུར་ཏོ། །
en: “Blessed One, all the hundreds of thousands of bodhisattva acts and hardships that the Blessed One engaged in when he was practicing bodhisattva conduct in the past have become evident to me.

source: བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་སྔོན་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ལས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པའི་བཟོད་པ་ཐོབ་པ་དེ་ལ་འཇུག་པའི་རྣམ་པར་དབྱེ་བ་བསྟན་པ་ཅུང་ཟད་ཅིག་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: Blessed One, please disclose a few details of how the Blessed One trained as a bodhisattva under the Thus-Gone One, the worthy one, the perfect Buddha Dīpaṃkara and how he attained acceptance of the unborn nature of phenomena.

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་གང་བདག་གིས་ཐོས་ནས་དེ་བཞིན་ཉིད་དུ་བསྒྲུབས་པས་ཆོས་དེ་འཐོབ་པར་འགྱུར།
en: Blessed One, after hearing about this acceptance of the unborn nature of phenomena attained by the bodhisattva, I will accomplish it in the same way and thereby attain that quality!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ལྷའི་བུ་འོད་ཟེར་སྲུང་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: replied the Blessed One,

source: འོད་ཟེར་སྲུང་བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་རྩ་བ་མ་བསྐྲུན་པ་རྣམས་ཀྱིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་མི་འགྱུར་གྱིས།
en: “Guardian of Light Rays,” “bodhisattvas who have not generated roots of virtue will not reach acceptance of the unborn nature of phenomena, but

source: བྱང་ཆུབ་སེམས་དཔའ་དགེ་བའི་རྩ་བ་བརྟན་པ་རྣམས་ཀྱིས་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་འགྱུར་རོ། །
en: bodhisattvas who possess stable roots of virtue will reach this acceptance.

source: འོད་ཟེར་སྲུང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་འགྱུར་རོ། །
en: Guardian of Light Rays, if bodhisattvas possess four qualities, they will reach acceptance of the unborn nature of phenomena.

source: སངས་རྒྱས་མཉམ་པ་ཉིད་དང་། ཆོས་མཉམ་པ་ཉིད་དང་། དགེ་འདུན་མཉམ་པ་ཉིད་དང་། ཞིང་མཉམ་པ་ཉིད་དེ་
en: They are (1) realizing the sameness of the buddhas, (2) realizing the sameness of the Dharma, (3) realizing the sameness of the Saṅgha, and (4) realizing the sameness of the buddha realms.

source: ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་འདི་དག་དང་ལྡན་ན་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་འགྱུར་རོ། །
en: Divine son, if bodhisattvas possess those four qualities, they will reach acceptance of the unborn nature of phenomena.

source: ལྷའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་འགྱུར་རོ། །
en: “Furthermore, divine son, if bodhisattvas possess four other qualities, they will reach acceptance of the unborn nature of phenomena.

source: བསམ་གཏན་བཞིས་སྟོང་པ་ཉིད་ལ་རྣམ་པར་རྩེ་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གིས་ཐབས་མཁས་པ་ལ་རྣམ་པར་རྩེ་བ་དང་། མངོན་པར་ཤེས་པ་ལྔས་ཡེ་ཤེས་ལ་རྣམ་པར་རྩེ་བ་དང་། ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་ཀྱིས་རྫུ་འཕྲུལ་ལ་རྣམ་པར་རྩེ་བ་སྟེ།
en: They are (1) reveling in emptiness through the four concentrations, (2) reveling in skillful means through the six perfections, (3) reveling in wisdom through the five higher perceptions, and (4) reveling in magical power through unimpeded wisdom.

source: འོད་ཟེར་སྲུང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་འདི་དག་དང་ལྡན་ན་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་འགྱུར་རོ། །
en: Guardian of Light Rays, if bodhisattvas possess those four qualities, they will reach acceptance of the unborn nature of phenomena.

source: འོད་ཟེར་སྲུང་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་འགྱུར་རོ། །
en: “Furthermore, Guardian of Light Rays, if bodhisattvas possess four other qualities, they will reach acceptance of the unborn nature of phenomena.

source: ཕུང་པོ་རྣམས་ལ་བྱང་ཆུབ་ཚོལ་ཡང་ཕུང་པོ་རྣམས་ལ་བྱང་ཆུབ་ཀྱི་རང་བཞིན་དུ་མོས་པ་མ་ཡིན་པ་དང་། ཁམས་རྣམས་ལ་བྱང་ཆུབ་ཚོལ་ཡང་ཁམས་རྣམས་ལ་བྱང་ཆུབ་ཀྱི་རང་བཞིན་དུ་མོས་པ་མ་ཡིན་པ་དང་སྐྱེ་མཆེད་རྣམས་ལ་བྱང་ཆུབ་ཚོལ་ཡང་། སྐྱེ་མཆེད་རྣམས་ལ་བྱང་ཆུབ་ཀྱི་རང་བཞིན་དུ་མི་རྟོག་པ་དང་། ཆོས་ཐམས་ཅད་ལ་བྱང་ཆུབ་ཚོལ་ཡང་ཆོས་ཐམས་ཅད་ལ་བྱང་ཆུབ་ཀྱི་རང་བཞིན་དུ་མོས་པ་མ་ཡིན་པ་སྟེ།
en: They are (1) not believing that the aggregates have the nature of awakening, even while seeking awakening in the aggregates, (2) pursuing awakening on the basis of the elements without believing that the elements have the nature of awakening, (3) pursuing awakening on the basis of the sense sources without thinking that the sense sources have the nature of awakening, and (4) pursuing awakening on the basis of all phenomena without believing that phenomena have the nature of awakening.

source: མི་གཡོ་བའི་ཚུལ་གྱིས་ཆོས་ཐམས་ཅད་ཡང་དག་པའི་མཐའ་ལ་གནས་པར་ཤེས་པ་དང་། དུས་གསུམ་མཉམ་པ་ཉིད་པས་ཆོས་ཐམས་ཅད་དེ་བཞིན་ཉིད་ལ་གནས་པར་འཇུག་པ་དང་། ཆོས་ཐམས་ཅད་མཚན་ཉིད་འདྲེས་པ་མེད་པས་ཆོས་ཀྱི་དབྱིངས་སུ་འདུ་བར་ཤེས་པ་དང་། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཀྱི་རྗེས་སུ་སོང་བས་ནམ་མཁའི་རང་བཞིན་དུ་སོ་སོར་རྟོག་པ་སྟེ།
en: They are (1) knowing that all phenomena dwell within the limit of reality due to the immutable nature, (2) understanding that all phenomena abide in suchness due to the sameness of the three times, (3) knowing that all phenomena are subsumed within the realm of phenomena due to their unadulterated characteristics, and (4) comprehending that all phenomena have the nature of space due to their nature of sameness.

source: མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པ་བསྟན་པ་འདི་བཤད་པ་ན་བྱང་ཆུབ་སེམས་དཔའ་ལྔ་སྟོང་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: When this teaching on acceptance of the unborn nature of phenomena was given, five thousand bodhisattvas reached acceptance of the unborn nature of phenomena, and

source: ལྷའི་བུ་འོད་ཟེར་སྲུང་ནི་རྗེས་སུ་འཐུན་པར་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པར་གྱུར་ཏོ། །
en: the divine son Guardian of Light Rays reached acceptance of phenomena concordant with the truth.

source: ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་ཐ་མར་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ།
en: At the conclusion of this Dharma teaching, the Blessed One said to venerable Ānanda,

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་ཞུས་པ་ཕ་རོལ་ཏུ་ཕྱིན་པས་འདུལ་བ་བསྟན་པའི་སྒོའི་ལེའུའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཟུང་ངམ།
en: “Ānanda, did you receive this Dharma teaching on the questions of the kiṃnara king Druma—the discourse about the gateway that shows how to train by means of the perfections?”

source: ཀུན་དགའ་བོས་གསོལ་པ།
en: replied Ānanda,

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཀྱི་མཐུ་ཉིད་ཀྱིས་བདག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཟུང་ལགས་སོ། །
en: “Blessed One,” “I have received this Dharma teaching due to the power of the Buddha.

source: བཅོམ་ལྡན་འདས་ཀྱེ་མའོ་ཇི་ཙམ་དུ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཟབ་མོ་རྣམ་པར་ངེས་པ་དང་དོན་བཟང་པོ་དང་ཚིག་འབྲུ་བཟང་པོས་བརྒྱན་པ་ནི་མཛེས་ཏེ་ངོ་མཚར་ཏོ། །
en: Oh! Blessed One, this Dharma teaching that establishes the profound nature, has an excellent meaning, and is adorned by excellent words, is magnificent and amazing!

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་སྒོམ་བསྡུས་པ་དེ་གང་ཡང་མ་མཆིས་སོ། །
en: Blessed One, there are no Dharma gateways that have not been included by the Blessed One in this Dharma teaching.

source: བཅོམ་ལྡན་འདས་སྔོན་བདག་ལ་ཆོས་སྣང་བར་གྱུར་པ་གང་ལགས་པ་དེ་ཡང་ང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལ་བརྟེན་ནས་འབུམ་འགྱུར་དུ་སྐྱེས་སོ། །
en: Blessed One, whatever understanding I had of the Dharma previously has now increased a hundred thousand times based on this Dharma teaching.

source: བཅོམ་ལྡན་འདས་བདག་ནི་འདི་སྙམ་དུ་བདག་ལྟ་བུ་ཉི་ཚེ་བའི་འཆལ་བ་དང་ལྡན་པ་བློ་ཆུང་ངུ་ཉན་ཐོས་ཀྱི་ཐེག་པའི་སྐྱོན་མ་མཆིས་པ། ཐ་ཆད་ལ་ཞུགས་པར་གནས་པས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་ཀྱང་འདི་ལྟ་བུའི་ཆོས་ཀྱི་སྣང་བ་འདི་སྐྱེས་པར་གྱུར་ན
en: Blessed One, I think that if hearing this Dharma teaching can cause such an understanding of the Dharma to arise in someone like me—who has limited understanding, who has the lesser capacity aimed at the faultless state of the vehicle of the hearers, and who is misguided—

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡེ་ཤེས་ཚད་མ་མཆིས་པའི་སྣོད་དུ་གྱུར་པ། བློ་རྒྱ་ཆེ་ཞིང་རྒྱ་མཚོ་ལྟ་བུ་དང་ལྡན་པ། ཆོས་རིན་པོ་ཆེ་ཐམས་ཅད་ཡོངས་སུ་འཛིན་པ། གསོལ་བ་མ་བཏབ་པར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་བཤེས་གཉེན་བགྱི་བ་གང་ལགས་པ་དེ་དག་གིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ན་ཆོས་ཀྱི་སྣང་བ་ཇི་སྙེད་ཅིག་ཐོབ་པར་འགྱུར་བ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ་སྙམ་བགྱིད་དོ། །
en: it is needless to say that hearing this Dharma teaching will lead to complete understanding of the Dharma for bodhisattva great beings who are proper vessels in their boundless wisdom, have capacities as vast as oceans, possess all the jewels of the Dharma, and act as spiritual friends to all beings without being asked!”

source: ཀུན་དགའ་བོ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ཉི་མ་དང་ཟླ་བའི་སྣང་བ་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ནི་དེ་བཞིན་གཤེགས་པའི་སྤུ་གཅིག་གི་འོད་ཀྱིས་མོག་མོག་པོར་འགྱུར་རོ། །
en: “Ānanda,” “The light emitted by a single hair of the Thus-Gone One’s body eclipses all sunlight and moonlight in this great trichiliocosm.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པའི་སྤུའི་ཁུང་བུ་ཐམས་ཅད་ནས་འོད་ཇི་སྙེད་བྱུང་བ་དེ་དག་ནི་ཤེས་རབ་ཀྱི་འོད་ཀྱིས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ་སྟེ།
en: Still, Ānanda, the light emitted from all the pores of hair on the Thus-Gone One’s body does not match a hundredth fraction of the light of insight.

source: སྟོང་གི་ཆ་དང་། སྟོང་ཕྲག་བརྒྱའི་ཆ་དང་། བྱེ་བའི་ཆ་དང་། བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གི་ཆ་དང་། གྲངས་དང་། ཆ་དང་། བགྲང་བ་དང་། དཔེ་དང་། རྒྱུར་ཡང་ཉེ་བར་མི་འགྲོའོ། །
en: It does not match a thousandth fraction, a hundred thousandth fraction, a millionth fraction, or a trillionth fraction. In fact, no number, fraction, enumeration, example, or illustration comes close.

source: སྣང་བ་ཐམས་ཅད་ནི་ཤེས་རབ་ཀྱི་སྣང་བ་ལས་བྱུང་བའི་ཕྱིར་རོ། །
en: Because all light originates from the light of insight.

source: ཀུན་དགའ་བོ་དེ་བཞིན་གཤེགས་པའི་ཤེས་རབ་ཀྱི་སྣང་བ་གང་ཡིན་པ་ཤེས་རབ་ཀྱི་སྣང་བ་དེ་དང་ལྡན་ན་
en: Ānanda, if noble sons and daughters possess that light of insight—the light of insight of the thus-gone ones—

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་འདས་པ་དང་མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་སྤྱོད་པ་དང་། གཡོ་བ་རྣམས་མཁྱེན་པའི་ཤེས་རབ་ཀྱི་སྣང་བ་དེ་ལྟ་བུ་དང་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་དག་ལྡན་པར་འགྱུར་རོ། །
en: they will possess the light of insight by which the thus-gone ones, the worthy ones, the perfect buddhas know the thoughts and concepts of all past, present, and future beings.

source: ཀུན་དགའ་བོ་གང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉན་པ་དང་། ཐོས་ནས་ཀྱང་མོས་པ་དང་། མོས་ནས་ཀྱང་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་པ་དང་། ཚུལ་བཞིན་དུ་སོ་སོར་རྟོགས་པ་དང་། དེ་བཞིན་དུ་བསྒྲུབ་པ་དེ་དག་ནི་བྱང་ཆུབ་ཀྱི་སེམས་མི་བརྗེད་པ་དང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དོན་དུ་གཉེར་བ་དང་སྙིང་རྗེ་ཆེན་པོའི་གོ་ཆ་བགོས་པ་དང་། བྱམས་པ་ཆེན་པོའི་གོ་ཆ་བགོས་པ་དང་། བདུད་དང་ཕྱིར་རྒོལ་བ་བཅོམ་པ་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོར་གཞོལ་བའི་སྐྱེས་བུ་དམ་པར་རིག་པར་བྱའོ། །
en: Ānanda, you should know that those who listen to this Dharma teaching, develop trust in it, keep it in mind, hold it, read it, comprehend it, fully teach it to others, correctly understand it, and practice it accordingly are sublime beings who will never forget the mind set on awakening but will exert themselves in ripening beings. They will don the armor of great love and compassion, defeat demons and opponents, and proceed toward the seat of awakening.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then venerable Ānanda asked the Blessed One,

source: བཅོམ་ལྡན་འདས་གང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་མོས་པ་དང་། འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་བསོད་ནམས་ཇི་སྙེད་ཅིག་སྐྱེད་པར་འགྱུར།
en: “Blessed One, how much merit is generated by a noble son or daughter who is devoted to this Dharma teaching upon hearing it, who keeps it in mind, holds it, reads it, comprehends it, and fully teaches it to others?”

source: ཀུན་དགའ་བོ་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་སྔ་དྲོའི་དུས་ཀྱི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་རབ་ཏུ་བཀང་སྟེརྒྱུན་དུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་དང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་སྦྱིན་པ་བྱིན་པ་དང་།
en: “Ānanda,” “imagine that a noble son or daughter practices generosity by, in the morning, filling this entire great trichiliocosm with the seven precious substances and offering this to the stream enterers, the once returners, the nonreturners, the worthy ones, the solitary buddhas, and the thus-gone ones, the worthy ones, the perfect buddhas.

source: དེ་བཞིན་དུ་ཉི་མའི་གུང་དང་། ཕྱེ་མ་རེད་ཀྱི་དུས་དང་། སྲོད་དང་། ནམ་གྱི་གུང་ཐུན་དང་། ཐོ་རས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ཡོངས་སུ་བཀང་སྟེདེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱི་བར་ལ་སྦྱིན་པ་བྱིན་པ་དང་། རྣམ་གྲངས་འདི་ལྟ་བུས་ལོ་གཅིག་གམ། ལོ་བརྒྱའམ། ལོ་སྟོང་ངམ། ལོ་བརྒྱ་ཕྲག་སྟོང་དུ་སྦྱིན་པ་བྱིན་ན་
en: Similarly, imagine that he or she practices generosity by filling, at noon, during the afternoon, at dusk, during nighttime, and at dawn, all the worlds of the great trichiliocosm with the seven precious substances and offering this to all of them. Then, imagine that he or she practices generosity on that scale for a year, for a hundred years, for a thousand years, and for a hundred thousand years.

source: ཀུན་དགའ་བོ་དེ་ལ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེ་གཞི་དེ་ལས་བསོད་ནམས་མང་དུ་སྐྱེད་དམ།
en: What do you think Ānanda, would that noble son or daughter generate a lot of merit on that basis?”

source: བཅོམ་ལྡན་འདས་མང་སྟེ་ཚད་མ་མཆིས་སོ། །
en: “Blessed One, the amount of merit generated would be huge! It would be immeasurable!

source: བདེ་བར་གཤེགས་པ་དཔག་ཏུ་མ་མཆིས་སོ། །
en: Blissful One, the merit generated would be boundless!

source: བཅོམ་ལྡན་འདས་གདུགས་གཅིག་བསགས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དེ་ཡང་ཚད་མ་མཆིས་ན། དགུང་ལོ་བརྒྱ་ཕྲག་སྟོང་དུ་བསགས་པ་ལྟ་སྨོས་ཀྱང་ཅི་འཚལ།
en: Blessed One, the heap of merit generated from doing this for one day is immeasurable, to say nothing of the heap of merit generated by practicing such generosity for a hundred thousand years!”

source: ཀུན་དགའ་བོ་ཁྱོད་མོས་པར་བྱའོ། །ཁྱོད་ཀྱིས་ཁོང་དུ་ཆུད་པར་བྱའོ། །
en: “Ānanda, think about this and understand this point:

source: བྱང་ཆུབ་དོན་དུ་གཉེར་བ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དོན་དུ་གཉེར་བ་དང་། སེམས་ཅན་རབ་ཏུ་ཐར་པར་བྱ་བ་དོན་དུ་གཉེར་བ་གང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཐོས་ནས་མོས་སམ། འཛིན་ཏམ། འཆང་ངམ། ཀློག་གམ། ཀུན་ཆུབ་པར་བྱེད་ན་
en: if someone who strives to reach awakening, to turn the wheel of Dharma, and to liberate beings is devoted to this Dharma teaching upon hearing it, and then keeps it in mind, holds it, reads it, and comprehends it,

source: རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་དེ་དེ་ལས་བསོད་ནམས་ཀྱི་ཕུང་པོ་མང་དུ་སྐྱེད་ན་
en: such a noble son or daughter who follows the Great Vehicle will generate an amount of merit larger than that.

source: གང་དེ་བཞིན་ཉིད་དུ་བསྒྲུབ་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: That being so, what need is there to mention the merit generated by those who put it into practice in accordance with reality?!

source: ཀུན་དགའ་བོ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལས་ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་ཙམ་འཛིན་ཏམ། འཆང་ངམ། ཀློག་གམ། ཀུན་ཆུབ་པར་བྱེད་དམ། གཞན་དག་ལ་ཡང་སྟོན་ན་དེ་ནི་སྦྱིན་པ་ཞེས་བྱ་སྟེ
en: Because, Ānanda, keeping in mind even a single verse of four lines from this Dharma teaching, holding it, reading it, comprehending it, and fully teaching it to others is known as generosity , and

source: དེ་ནི་སྦྱིན་པ་ཐམས་ཅད་ཟིལ་གྱིས་གནོན་པའོ། །
en: that generosity surpasses all other forms of generosity.

source: ཆོས་ཀྱི་སྦྱིན་པ་འདི་ནི་སྦྱིན་པ་རྣམས་ཀྱི་མཆོག་གོ། །
en: Generosity with the Dharma is the supreme form of generosity,

source: ཆོས་ཀྱི་རྗེས་སུ་འཛིན་པ་དེ་ནི་རྗེས་སུ་བཟུང་བ་རྣམས་ཀྱི་མཆོག་གོ། །
en: assistance with the Dharma is the supreme form of assistance,

source: ཆོས་ཀྱི་གདིང་བ་དེ་ནི་གདིང་བ་རྣམས་ཀྱི་མཆོག་གོ། །
en: the act of spreading the Dharma is the supreme form of action, and

source: ཆོས་ཡོངས་སུ་འཛིན་པ་དེ་ནི་ཡོངས་སུ་འཛིན་པ་རྣམས་ཀྱི་མཆོག་གོ། །
en: the acquisition of the Dharma is the supreme form of acquisition.

source: ཀུན་དགའ་བོ་ཆོས་ཀྱི་སྦྱིན་པ་བྱིན་པས་ནི་ཉོན་མོངས་པ་འབྲི་བར་འགྱུར་རོ། །
en: Because, Ānanda, generosity with the Dharma will cause afflictions to decrease while

source: ཟང་ཟིང་གི་སྦྱིན་པ་བྱིན་པས་ནི་ལུས་བརྟན་པ་བྱས་པར་འགྱུར་རོ། །
en: generosity with material things will merely support the body.

source: ཀུན་དགའ་བོ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉོན་མོངས་པ་འབྲི་བར་བྱེད་འདོད་པས་སངས་རྒྱས་ཀྱིས་གནང་བ་ཆོས་ཀྱི་སྦྱིན་པ་དེ་སྦྱིན་པར་བྱ་སྟེ།
en: Therefore, Ānanda, bodhisattvas who wish to reduce their afflictions should practice generosity with the Dharma authorized by the Buddha.

source: ཆོས་ཀྱི་སྦྱིན་པ་དེས་ནི་ཡོན་ཏན་གྱི་ཁྱད་པར་ཐམས་ཅད་ཐོབ་པར་འགྱུར་རོ། །
en: Through this generosity with the Dharma, all extraordinary qualities will be attained.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་སྦྱིན་པ་སྦྱིན་པ་ནི་ཡོན་ཏན་གྱི་ཕན་ཡོན་ཡང་དག་ཕུལ་སུམ་ཅུ་རྩ་གཉིས་རབ་ཏུ་འཛིན་པར་འགྱུར་རོ། །
en: “The bodhisattvas who practice generosity with the Dharma will gain thirty-two excellent and valuable benefits.

source: འདི་ལྟ་སྟེ་དྲན་པ་དང་ལྡན་པར་འགྱུར་བ་དང་། བློ་གྲོས་དང་ལྡན་པར་འགྱུར་བ་དང་། རྟོག་པ་དང་ལྡན་པར་འགྱུར་བ་དང་།
en: (1) They will develop mindfulness. (2) They will develop intelligence. (3) They will develop understanding.

source: འདོད་ཆགས་ཆུང་བར་འགྱུར་བ་དང་། ཞེ་སྡང་ཆུང་བར་འགྱུར་བ་དང་། གཏི་མུག་ཆུང་བར་འགྱུར་བ་དང་། བདག་དང་གཞན་གྱི་ཉོན་མོངས་པ་ཚར་གཅོད་པར་འགྱུར་བ་དང་།
en: (4) Their desires will decrease. (5) Their anger will decrease. (6) Their ignorance will decrease. (7) They will overcome the afflictions in themselves and others.

source: སྐྱེ་བོ་མང་པོ་དགའ་བར་འགྱུར་བ་དང་། དེའི་བསྔགས་པ་ལྷ་རྣམས་ཀྱིས་བརྗོད་པར་འགྱུར་བ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་རྣམས་ཀྱིས་བསྲུང་བར་འགྱུར་བ་དང་།
en: (8) They will please many beings. (9) The gods will proclaim their praises. (10) They will be protected by gods, nāgas, yakṣas, and gandharvas.

source: ལས་བྱས་ནས་བསོད་སྙོམས་ཟ་བར་འགྱུར་བ་དང་། ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་རྙེད་པར་འགྱུར་བ་དང་།
en: (11) They will receive alms after performing service. (12) They will receive Dharma robes, alms, bedding, medicine, and provisions.

source: གྲགས་པ་དང་། སྒྲ་དང་། ཚིགས་སུ་བཅད་པ་ཕྱོགས་བཅུར་གྲགས་པར་འགྱུར་བ་དང་། མི་མ་ཡིན་པ་རྣམས་ཀྱིས་གླགས་རྙེད་པར་མི་འགྱུར་བ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་བསྔགས་པར་འགྱུར་བ་དང་།
en: (13) Their renown, repute, and praise will spread in the ten directions. (14) They will not be harmed by nonhumans. (15) They will be praised by the blessed buddhas.

source: དམ་པའི་ཆོས་ཡོངས་སུ་བསྲུང་བ་དང་། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་དམ་པའི་ཆོས་འཛིན་པར་འགྱུར་བ་དང་།
en: (16) They will guard the sacred Dharma. (17) They will uphold the sacred Dharma of the blessed buddhas.

source: ངན་སོང་ཐམས་ཅད་ཀྱིས་འཇིགས་པར་མི་འགྱུར་ཞིང་། དེ་ལ་ལྷ་དང་མིར་སྐྱེ་བ་དཀའ་བར་མི་འགྱུར་བ་དང་། སངས་རྒྱས་མཐོང་བ་དང་མི་འབྲལ་བར་འགྱུར་བ་དང་། དགེ་འདུན་ལ་བསྙེན་བཀུར་བྱེད་པ་དང་བྲལ་བར་མི་འགྱུར་བ་དང་།
en: (18) They will not be frightened by any of the lower realms. (19) It will not be difficult for them to be reborn as gods and humans. (20) They will continuously behold the buddhas. (21) They will continuously venerate the Saṅgha.

source: སྐྱེ་བ་དྲན་པར་འགྱུར་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་སྐྱེ་བར་འགྱུར་བ་དང་།
en: (22) They will remember their previous lives. (23) They will be reborn into pure buddha realms.

source: ནམ་དུ་ཡང་དབང་པོ་མི་ཚང་བར་མི་འགྱུར་བ་དང་། སྐྱེས་བུ་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་ཐོབ་པར་འགྱུར་བ་དང་། གཟི་བརྗིད་ཅན་གྱི་གཟུངས་ཀྱི་ས་བོན་བསྒྲུབ་པར་འགྱུར་བ་དང་།
en: (24) They will never be born with impaired faculties. (25) They will attain the thirty-two major marks of great beings. (26) They will manifest the seeds of magnificent retention.
